app/controllers/posts_controller.rb

def new
  if params[:author_id] && !Author.exists?(params[:author_id]) #check for params[:author_id]
---
SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"

def edit
if params[:author_id] #comes from our nested route
  author = Author.find_by(id: params[:author_id]) #find valid author
  if author.nil?
    redirect_to authors_path, alert: "Author not found." #flash alert if can't find valid author
  else
    @post = author.posts.find_by(id: params[:id]) #if author valid, find post by params[:id], query through our author.posts
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]